#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with module.s3_website.aws_s3_bucket.website_bucket,
  on modules/s3_website/main.tf line 6, in resource "aws_s3_bucket" "website_bucket":
   6: resource "aws_s3_bucket" "website_bucket" {

Use the aws_s3_bucket_website_configuration resource instead

(and 3 more similar warnings elsewhere)

Warning: Deprecated Resource

  with module.s3_website.aws_s3_bucket_object.index,
  on modules/s3_website/main.tf line 16, in resource "aws_s3_bucket_object" "index":
  16: resource "aws_s3_bucket_object" "index" {

use the aws_s3_object resource instead

(and one more similar warning elsewhere)

Warning: Deprecated attribute

  on modules/s3_website/outputs.tf line 6, in output "website_url":
   6:   value       = aws_s3_bucket.website_bucket.website_endpoint

The attribute "website_endpoint" is deprecated. Refer to the provider
documentation for details.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_sms.data.archive_file.lambda_zip: Reading...
module.lambda_email.data.archive_file.lambda_zip: Reading...
module.lambda_push.data.archive_file.lambda_zip: Reading...
module.lambda_push.data.archive_file.lambda_zip: Read complete after 0s [id=cf90aa5523c4458d7a7168027c795780e0f378b1]
module.lambda_email.data.archive_file.lambda_zip: Read complete after 0s [id=aca9b8730a3771d263390db2f86fb9b825195bc2]
module.lambda_sms.data.archive_file.lambda_zip: Read complete after 0s [id=32fb6fc8aa724c7408f68078ecb764ff60b1d88a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api_gateway.aws_api_gateway_deployment.api_deployment will be created
  + resource "aws_api_gateway_deployment" "api_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "dev"
    }

  # module.api_gateway.aws_api_gateway_integration.post_send_email_integration will be created
  + resource "aws_api_gateway_integration" "post_send_email_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + request_templates       = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:us-east-1:sns:action/Publish"
    }

  # module.api_gateway.aws_api_gateway_integration.post_send_push_integration will be created
  + resource "aws_api_gateway_integration" "post_send_push_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + request_templates       = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:us-east-1:sns:action/Publish"
    }

  # module.api_gateway.aws_api_gateway_integration.post_send_sms_integration will be created
  + resource "aws_api_gateway_integration" "post_send_sms_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + request_templates       = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:us-east-1:sns:action/Publish"
    }

  # module.api_gateway.aws_api_gateway_method.post_send_email will be created
  + resource "aws_api_gateway_method" "post_send_email" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_method.post_send_push will be created
  + resource "aws_api_gateway_method" "post_send_push" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_method.post_send_sms will be created
  + resource "aws_api_gateway_method" "post_send_sms" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_resource.send_email will be created
  + resource "aws_api_gateway_resource" "send_email" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "sendEmail"
      + rest_api_id = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_resource.send_push will be created
  + resource "aws_api_gateway_resource" "send_push" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "sendPush"
      + rest_api_id = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_resource.send_sms will be created
  + resource "aws_api_gateway_resource" "send_sms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "sendSMS"
      + rest_api_id = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_rest_api.notification_api will be created
  + resource "aws_api_gateway_rest_api" "notification_api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API Gateway for Notification Platform"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "aws-notification-platform-dev-notification-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration (known after apply)
    }

  # module.iam.aws_iam_policy_attachment.lambda_basic_execution will be created
  + resource "aws_iam_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + name       = "aws-notification-platform-dev-lambda-basic-execution"
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + roles      = [
          + "aws-notification-platform-dev-lambda-role",
        ]
    }

  # module.iam.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws-notification-platform-dev-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda_email.aws_lambda_function.email_lambda will be created
  + resource "aws_lambda_function" "email_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/lambda_email/lambda_email.zip"
      + function_name                  = "aws-notification-platform-dev-email"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "5cM9t0EFCUW7JzcvZUdDIa/YQTKJ7RzdtN0D9Obg0Ng="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CHANNEL" = "EMAIL"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambda_push.aws_lambda_function.push_lambda will be created
  + resource "aws_lambda_function" "push_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/lambda_push/lambda_push.zip"
      + function_name                  = "aws-notification-platform-dev-push"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "qwnkOTEmfloA+BEMgq7P1wh8FHDpwOVoLZ3TZTpgq1k="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CHANNEL" = "PUSH"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambda_sms.aws_lambda_function.sms_lambda will be created
  + resource "aws_lambda_function" "sms_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/lambda_sms/lambda_sms.zip"
      + function_name                  = "aws-notification-platform-dev-sms"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "1BqePwI3pUdLCUxvhMf/HwnvAmr1tch5CLI3XqEUfZ4="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CHANNEL" = "SMS"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.s3_website.aws_s3_bucket.website_bucket will be created
  + resource "aws_s3_bucket" "website_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "aws-notification-platform-dev-website"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website {
          + error_document = "error.html"
          + index_document = "index.html"
        }
    }

  # module.s3_website.aws_s3_bucket_object.error will be created
  + resource "aws_s3_bucket_object" "error" {
      + acl                    = "private"
      + arn                    = (known after apply)
      + bucket                 = "aws-notification-platform-dev-website"
      + bucket_key_enabled     = (known after apply)
      + content                = "<html><body><h1>Error occurred.</h1></body></html>"
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "error.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.s3_website.aws_s3_bucket_object.index will be created
  + resource "aws_s3_bucket_object" "index" {
      + acl                    = "private"
      + arn                    = (known after apply)
      + bucket                 = "aws-notification-platform-dev-website"
      + bucket_key_enabled     = (known after apply)
      + content                = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.sns.aws_sns_topic.email_topic will be created
  + resource "aws_sns_topic" "email_topic" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "aws-notification-platform-dev-email-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.sns.aws_sns_topic.push_topic will be created
  + resource "aws_sns_topic" "push_topic" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "aws-notification-platform-dev-push-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.sns.aws_sns_topic.sms_topic will be created
  + resource "aws_sns_topic" "sms_topic" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "aws-notification-platform-dev-sms-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.sns.aws_sns_topic_subscription.email_lambda_subscription will be created
  + resource "aws_sns_topic_subscription" "email_lambda_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.sns.aws_sns_topic_subscription.push_lambda_subscription will be created
  + resource "aws_sns_topic_subscription" "push_lambda_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.sns.aws_sns_topic_subscription.sms_lambda_subscription will be created
  + resource "aws_sns_topic_subscription" "sms_lambda_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.api_gateway.aws_api_gateway_deployment.api_deployment,
  on modules/api_gateway/main.tf line 114, in resource "aws_api_gateway_deployment" "api_deployment":
 114:   stage_name  = var.environment

The attribute "stage_name" will be removed in a future major version. Use an
explicit "aws_api_gateway_stage" instead.

(and 10 more similar warnings elsewhere)

Warning: Deprecated Resource

  with module.s3_website.aws_s3_bucket_object.index,
  on modules/s3_website/main.tf line 16, in resource "aws_s3_bucket_object" "index":
  16: resource "aws_s3_bucket_object" "index" {

use the aws_s3_object resource instead

(and 3 more similar warnings elsewhere)

Warning: Deprecated attribute

  on modules/s3_website/outputs.tf line 6, in output "website_url":
   6:   value       = aws_s3_bucket.website_bucket.website_endpoint

The attribute "website_endpoint" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Dubovsky-Andrey, Action: `pull_request`*